# basics

In [81]:
import numpy as np
import pandas as pd

In [82]:
# creating a dataframe
df = pd.DataFrame(
    {
    "Name":["ammar", "mohammed", "salma"],
    "Age":[18, 26, 20],
    "Gender":["male", "male", "female"]
    }
) 
df

       Name  Age  Gender
0     ammar   18    male
1  mohammed   26    male
2     salma   20  female

In [83]:
# accessing a df
print(df["Age"])
highest_age = df["Age"].max()
highest_age_index = df["Age"].idxmax()
highest_age_person = df.loc[highest_age_index, "Name"]
print(f"highest age is {highest_age_person} with {highest_age}")

0    18
1    26
2    20
Name: Age, dtype: int64
highest age is mohammed with 26

In [84]:
# creating and adding a column to a dataframe
score = pd.Series([95, 100, 80], name = "Score")
df["Score"] = score
df

       Name  Age  Gender  Score
0     ammar   18    male     95
1  mohammed   26    male    100
2     salma   20  female     80

In [85]:
# creating and adding a row to a dataframe
s = pd.Series({"Name": "Abdullah", "Age":29, "Gender":"male", "Score":90})
df = pd.concat([df, s.to_frame().T], ignore_index=True)
df

       Name Age  Gender Score
0     ammar  18    male    95
1  mohammed  26    male   100
2     salma  20  female    80
3  Abdullah  29    male    90

In [86]:
# creating a df with random values
frame = pd.DataFrame(np.random.randn(1000, 5), columns=["a", "b", "c", "d", "e"])
frame

            a         b         c         d         e
0    0.402138 -1.209152  2.284759  0.057203  0.298675
1    0.239660 -0.832933 -0.157755 -0.418097 -0.027979
2    2.331020  0.728418  0.164615 -1.831252  1.153305
3    0.597519  0.584572  0.136205  2.917577  0.134153
4    1.337961  0.426735 -0.617580 -0.077445  0.208566
..        ...       ...       ...       ...       ...
995  0.647394  0.583787 -0.004842 -0.259060 -0.861234
996 -0.365794 -1.199675 -0.660669  1.780094  2.260899
997  0.706823 -1.247054 -1.645525 -0.037371  0.229931
998  0.604604 -1.958296 -0.525714  0.520444 -0.497043
999 -0.182106  1.474201  0.139092 -0.056328  0.766653

[1000 rows x 5 columns]

In [87]:
# finding basic statistics of numerical data in the dataframe
frame.describe()

                 a            b            c            d            e
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025075     0.011162    -0.012036     0.015647     0.019679
std       1.013424     0.976740     0.999497     1.014784     1.032255
min      -3.122314    -2.987782    -2.767588    -3.650668    -2.875889
25%      -0.652331    -0.654982    -0.688691    -0.663896    -0.679997
50%       0.007459     0.039943    -0.007024     0.025072     0.014024
75%       0.719439     0.680188     0.665341     0.680130     0.703127
max       2.889173     3.528409     3.552663     3.680377     3.024507

In [88]:
# finding basic statistics of non numerical data in the dataframe
df.describe()

         Name  Age Gender  Score
count       4    4      4      4
unique      4    4      2      4
top     ammar   18   male     95
freq        1    1      3      1

# reading, writing, and converting (.txt, .csv, .xlsx)

example 1: titanic.csv -> pd -> titanic.xlsx -> pd

In [ ]:
# reading titanic.csv
titanic = pd.read_csv("data/titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# converting titanic.csv to titanic.xlsx
titanic = pd.read_csv("data/titanic.csv")
titanic.to_excel("data/titanic.xlsx", index=False)

In [112]:
# converting .xlsx to .csv
titanic = pd.read_excel("data/titanic.xlsx")
titanic.to_csv("data/titanic.csv", index=False)

Example 1: products.txt -> df -> products.csv -> df -> products.xlsx -> df

In [ ]:
# converting products.txt to products.csv
products = pd.read_csv("data/products.txt", sep=",") #assuming comma-separated values
products.to_csv("data/products.csv", index=False)

In [ ]:
# converting products.csv to products.xlsx
products = pd.read_csv("data/products.txt", sep=",")
products.to_excel("data/products.xlsx", index=False)

In [ ]:
# reading products.xlsx
products = pd.read_excel("data/products.xlsx")
products

    ID            Name    Category  Price  Stock
0    1            Milk       Dairy    3.5     40
1    2           Bread      Bakery    2.0     60
2    3            Eggs       Dairy    5.0     30
3    4            Rice      Grains   10.0     25
4    5           Pasta      Grains    4.0     50
5    6  Chicken Breast        Meat   18.0     20
6    7          Apples       Fruit    6.0     45
7    8         Bananas       Fruit    4.0     55
8    9        Tomatoes  Vegetables    5.5     35
9   10        Potatoes  Vegetables    7.0     40
10  11          Cheese       Dairy   12.0     15
11  12          Yogurt       Dairy    3.0     50
12  13    Orange Juice      Drinks    6.5     30
13  14    Water Bottle      Drinks    1.5    100
14  15   Chocolate Bar      Snacks    2.5     80
15  16           Chips      Snacks    3.0     70
16  17           Sugar      Baking    4.5     40
17  18           Flour      Baking    5.0     35
18  19             Tea      Drinks    8.0     25
19  20          Coffee      Drinks   15.0     20

# selecting a subset of a DataFrame

#### selecting specific columns from a DataFrame

In [122]:
# ages of the titanic passengers
ages = titanic["Age"]
ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [ ]:
# name, age, and sex of the titanic passengers
name_age_sex = titanic[["Name", "Age", "Sex"]]
name_age_sex.head()

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                              Heikkinen, Miss Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

#### selecting specific rows from a DataFrame

In [170]:
# people that are older than 40
above_40 = titanic[titanic["Age"] > 40]
print(above_40.shape)
above_40.head(10)

(150, 12)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
35,36,0,1,"Holverson, Mr. Alexander Oskar",male,42.0,1,0,113789,52.0000,NaN,S
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
92,93,0,1,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S

#### selecting specific rows and columns from a DataFrame

In [167]:
# the names of the passengers older than 35 years
names_above_35 = titanic.loc[titanic["Age"] > 35, ["Name", "Age"]]
names_above_35.head(10)

                                                 Name   Age
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
6                             McCarthy, Mr. Timothy J  54.0
11                            Bonnell, Miss Elizabeth  58.0
13                        Andersson, Mr. Anders Johan  39.0
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0
25  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  38.0
30                           Uruchurtu, Don. Manuel E  40.0
33                              Wheadon, Mr. Edward H  66.0
35                     Holverson, Mr. Alexander Oskar  42.0
40     Ahlin, Mrs. Johan (Johanna Persdotter Larsson)  40.0

In [168]:
# people from pclass 2 and 3
class_23 = titanic.loc[titanic["Pclass"] > 1, ["Name", "Pclass"]]
class_23.head(10)

                                                 Name  Pclass
0                             Braund, Mr. Owen Harris       3
2                               Heikkinen, Miss Laina       3
4                            Allen, Mr. William Henry       3
5                                    Moran, Mr. James       3
7                       Palsson, Master Gosta Leonard       3
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3
9                 Nasser, Mrs. Nicholas (Adele Achem)       2
10                     Sandstrom, Miss Marguerite Rut       3
12                     Saundercock, Mr. William Henry       3
13                        Andersson, Mr. Anders Johan       3

In [171]:
# rows 10 till 25 and columns 3 to 5
titanic.iloc[9:25, 2:5]

    Pclass                                               Name     Sex
9        2                Nasser, Mrs. Nicholas (Adele Achem)  female
10       3                     Sandstrom, Miss Marguerite Rut  female
11       1                            Bonnell, Miss Elizabeth  female
12       3                     Saundercock, Mr. William Henry    male
13       3                        Andersson, Mr. Anders Johan    male
14       3                Vestrom, Miss Hulda Amanda Adolfina  female
15       2                   Hewlett, Mrs. (Mary D Kingcome)   female
16       3                                Rice, Master Eugene    male
17       2                       Williams, Mr. Charles Eugene    male
18       3  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female
19       3                            Masselmani, Mrs. Fatima  female
20       2                               Fynney, Mr. Joseph J    male
21       2                              Beesley, Mr. Lawrence    male
22       3                         McGowan, Miss Anna "Annie"  female
23       1                       Sloper, Mr. William Thompson    male
24       3                       Palsson, Miss Torborg Danira  female

# merging duplicate rows

example1

In [147]:
df = pd.DataFrame({
    "Name": ["Ammar", "Mohammed", "Ammar", "Salma"],
    "Age": [18, 20, 22, 25],
    "Score": [90, 80, 85, 95],
    "Sex": ["male", "male", "male", "female"]
})

print(df)

       Name  Age  Score     Sex
0     Ammar   18     90    male
1  Mohammed   20     80    male
2     Ammar   22     85    male
3     Salma   25     95  female

In [150]:
# add all numerical columns
df_merged = df.groupby("Name", as_index=False)[["Age", "Score"]].sum()
print(df_merged)

       Name  Age  Score
0     Ammar   40    175
1  Mohammed   20     80
2     Salma   25     95

example2

In [151]:
df = pd.DataFrame({
    "Name": ["Ammar", "Ammar", "Ammar", "Ammar"],
    "Age": [18, 18, 18, 18],
    "Score": ["90%", "3%", "5%", "0%"],
    "Projects": [20, 3, 5, 0]
})
df

    Name  Age Score  Projects
0  Ammar   18   90%        20
1  Ammar   18    3%         3
2  Ammar   18    5%         5
3  Ammar   18    0%         0

In [ ]:
# remove "%" from scores and turn into a float
df["Score_num"] = df["Score"].str.rstrip("%").astype(float)
df["Score_num"]

# group by Name and apply different aggregation rules
df_merged = df.groupby(["Name", "Age"], as_index=False).agg({
    "Age": "first" # select first value 
    "Score_num": "sum",   # sum the percentages
    "Projects": "sum"     # sum the projects
})
df_merged["Score"] = df_merged["Score_num"].astype(str) + "%" # turn the score back to str and add '%' back
df_merged = df_merged.drop(columns="Score_num") # drop the extra column created
df_merged

    Name  Age  Projects  Score
0  Ammar   18        28  98.0%

#### example3

In [ ]:
air_quality_no2_df = pd.read_csv("data/air_quality_no2_long.csv")
air_quality_no2_df.head(10)

    city country                   date.utc location parameter  value   unit
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  µg/m³
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  µg/m³
2  Paris      FR  2019-06-20 22:00:00+00:00  FR04014       no2   26.5  µg/m³
3  Paris      FR  2019-06-20 21:00:00+00:00  FR04014       no2   24.9  µg/m³
4  Paris      FR  2019-06-20 20:00:00+00:00  FR04014       no2   21.4  µg/m³
5  Paris      FR  2019-06-20 19:00:00+00:00  FR04014       no2   25.3  µg/m³
6  Paris      FR  2019-06-20 18:00:00+00:00  FR04014       no2   23.9  µg/m³
7  Paris      FR  2019-06-20 17:00:00+00:00  FR04014       no2   23.2  µg/m³
8  Paris      FR  2019-06-20 16:00:00+00:00  FR04014       no2   19.0  µg/m³
9  Paris      FR  2019-06-20 15:00:00+00:00  FR04014       no2   19.3  µg/m³

In [ ]:
# adding a new column that is reliant on an existant one
air_quality_no2_df["value2"] = air_quality_no2_df["value"] * 0.001
air_quality_no2_df["unit2"] = "mg/m³"
air_quality_no2_df

,city,country,date.utc,location,parameter,value,unit,value2,unit2
0,Paris,FR,2019-06-21 00:00:00+00:00,FR04014,no2,20.0,µg/m³,0.0200,mg/m³
1,Paris,FR,2019-06-20 23:00:00+00:00,FR04014,no2,21.8,µg/m³,0.0218,mg/m³
2,Paris,FR,2019-06-20 22:00:00+00:00,FR04014,no2,26.5,µg/m³,0.0265,mg/m³
3,Paris,FR,2019-06-20 21:00:00+00:00,FR04014,no2,24.9,µg/m³,0.0249,mg/m³
4,Paris,FR,2019-06-20 20:00:00+00:00,FR04014,no2,21.4,µg/m³,0.0214,mg/m³
...,...,...,...,...,...,...,...,...,...
2063,London,GB,2019-05-07 06:00:00+00:00,London Westminster,no2,26.0,µg/m³,0.0260,mg/m³
2064,London,GB,2019-05-07 04:00:00+00:00,London Westminster,no2,16.0,µg/m³,0.0160,mg/m³
2065,London,GB,2019-05-07 03:00:00+00:00,London Westminster,no2,19.0,µg/m³,0.0190,mg/m³
2066,London,GB,2019-05-07 02:00:00+00:00,London Westminster,no2,19.0,µg/m³,0.0190,mg/m³
2067,London,GB,2019-05-07 01:00:00+00:00,London Westminster,no2,23.0,µg/m³,0.0230,mg/m³

In [ ]:
# merging the rows by the city name and finding the averages of value and value2
air_quality_no2_df.groupby("city", as_index=False)[["value", "value2"]].mean().round(2)

        city  value  value2
0  Antwerpen  25.78    0.03
1     London  24.78    0.02
2      Paris  27.74    0.03

# merging similar-shaped tables

In [191]:
air_quality_pm25_df = pd.read_csv("data/air_quality_no2_long.csv")
air_quality_pm25_df.head(10)

    city country                   date.utc location parameter  value   unit
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  µg/m³
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  µg/m³
2  Paris      FR  2019-06-20 22:00:00+00:00  FR04014       no2   26.5  µg/m³
3  Paris      FR  2019-06-20 21:00:00+00:00  FR04014       no2   24.9  µg/m³
4  Paris      FR  2019-06-20 20:00:00+00:00  FR04014       no2   21.4  µg/m³
5  Paris      FR  2019-06-20 19:00:00+00:00  FR04014       no2   25.3  µg/m³
6  Paris      FR  2019-06-20 18:00:00+00:00  FR04014       no2   23.9  µg/m³
7  Paris      FR  2019-06-20 17:00:00+00:00  FR04014       no2   23.2  µg/m³
8  Paris      FR  2019-06-20 16:00:00+00:00  FR04014       no2   19.0  µg/m³
9  Paris      FR  2019-06-20 15:00:00+00:00  FR04014       no2   19.3  µg/m³